void setup()
{
  size(800,500);
  PFont font = createFont("標楷體",10);
  textFont(font);
}

String[] faces = {
  "黑桃A","黑桃2","黑桃3","黑桃4","黑桃5","黑桃6","黑桃7","黑桃8","黑桃9","黑桃10","黑桃J","黑桃Q","黑桃K",
  "黑桃A","黑桃2","黑桃3","黑桃4","黑桃5","黑桃6","黑桃7","黑桃8","黑桃9","黑桃10","黑桃J","黑桃Q","黑桃K",
  "黑桃A","黑桃2","黑桃3","黑桃4","黑桃5","黑桃6","黑桃7","黑桃8","黑桃9","黑桃10","黑桃J","黑桃Q","黑桃K",
  "黑桃A","黑桃2","黑桃3","黑桃4","黑桃5","黑桃6","黑桃7","黑桃8","黑桃9","黑桃10","黑桃J","黑桃Q","黑桃K"
};

void draw()
{
  background(#999999);
  for(int i=0;i<52;i++)
  {
    int x=(i%13)*60;
    int y=(i/13)*120;
    fill(125);
    rect(x,y,60,120);
    fill(200);
    text(faces[i],x+25,y+80);
  }
}
